/**
  ******************************************************************
  * @file    demo_uart_123.c
  * @author  Beny
  * @version V0.01
  * @date    2023-12-25
  * @brief   串口通讯
  ******************************************************************
  * @attention
  * 參考 verimake ch549 例程
  * CH549 串口1~3 查询与中断收发演示，实现数据回环
  * 注意包含CH549_debug.c
  ******************************************************************
  */

// #include <lint.h>  //No difference when excluded - Beny 2023-11-30
#include <CH549_sdcc.h>	 //ch549的头文件，其中定义了单片机的一些特殊功能寄存器
#include <CH549_debug.h> //CH549官方提供库的头文件，定义了一些关于主频，延时，串口设置，看门口，赋值设置等基础函数

/********************************************************************
* TIPS:
*  引脚            功能
*  P2.6            默认UART1——RXD1
*  P2.7            默认UART1——TXD1
*  P1.6            UART1引脚映射————RXD1_
*  P1.7            UART1引脚映射————TXD1_
*  P0.4            UART2——RXD2
*  P0.5            UART2——TXD2
*  P0.6            UART3——RXD3
*  P0.7            UART3——TXD3
*********************************************************************/

void main(void)
{
  CfgFsys();                  //CH549时钟选择配置
  _delay_ms(20);
  CH549UART1Init();           //串口1初始化
  CH549UART1Alter();          //串口1引脚映射-将串口一映射到 p1.6 和 p1.7  P1.6（UART1引脚映射————RXD1_）（P1.7 UART1引脚映射————TXD1_）
  CH549UART2Init();           //串口2初始化
  CH549UART3Init();           //串口3初始化
  printf("hello world\n");    //串口输出：“hello world”
  while(1);
}
